{"metadata":{"title":"Managed Services","roles":"Associate Consultant,Consultant,Senior Consultant,Lead Consultant,Managing Consultant,Principal Consultant","sortorder":2},"content":"<h1 id=\"associate-consultant-role-requirements\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#associate-consultant-role-requirements\"><span class=\"icon icon-link\"></span></a>Associate Consultant role requirements</h1>\n<p><img src=\"https://personas.purple.telstra.com/associateconsultant.svg\" alt=\"A cartoon of a associate consultant\" title=\"Associate Consultant\"></p>\n<p>I am focused on developing my capabilities to deliver value to our customers.</p>\n<ul>\n<li>I deliver net positive value to the team.</li>\n<li>I work well in a team.</li>\n<li>I take a pro-active approach to my professional development.</li>\n<li>I consistently demonstrate the Purple Beliefs.</li>\n</ul>\n<h1 id=\"consultant-role-requirements\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#consultant-role-requirements\"><span class=\"icon icon-link\"></span></a>Consultant role requirements</h1>\n<p><img src=\"https://personas.purple.telstra.com/consultant.svg\" alt=\"A cartoon of a consultant\" title=\"Consultant\"></p>\n<p>I am a valuable practitioner of my capability and deliver value to our customers.</p>\n<ul>\n<li>I am proficient in my field and deliver net positive value to my team and customers.</li>\n<li>I consistently demonstrate the Purple Beliefs.</li>\n<li>I work well in a team.</li>\n<li>I am coachable and pursue all opportunities to develop my skills and capabilities on engagements or professional development.</li>\n<li>Through the work that I provide at customer sites, I have built a positive reputation for myself and for Purple.</li>\n<li>I keep my customer and Purple stakeholders regularly informed of my work progress.</li>\n<li>I am a proficient communicator using relevant formats and mediums.</li>\n</ul>\n<h1 id=\"senior-consultant-role-requirements\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#senior-consultant-role-requirements\"><span class=\"icon icon-link\"></span></a>Senior Consultant role requirements</h1>\n<p><img src=\"https://personas.purple.telstra.com/seniorconsultant.svg\" alt=\"A cartoon of a senior consultant\" title=\"Senior Consultant\"></p>\n<p>I am an accomplished practitioner of my capability. I independently deliver value for our customers in typical initiatives or engagements.</p>\n<ul>\n<li>I am accomplished in my field.</li>\n<li>I work well independently and in a team.</li>\n<li>I take a methodical and analysis-based approach to troubleshooting.</li>\n<li>I am diligent in my delivery activities; I strive to exceed the expectations of my stakeholders.</li>\n<li>I actively look for, raise, and manage delivery risks, issues, and scope, to ensure successful project delivery.</li>\n<li>I set, manage and communicate clear expectations.</li>\n<li>My influence positively affects individuals within my team.</li>\n</ul>\n<h1 id=\"lead-consultant-role-requirements\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#lead-consultant-role-requirements\"><span class=\"icon icon-link\"></span></a>Lead Consultant role requirements</h1>\n<p><img src=\"https://personas.purple.telstra.com/leadconsultant.svg\" alt=\"A cartoon of a lead consultant\" title=\"Lead Consultant\"></p>\n<p>I deliver outcomes individually and by contributing through others. I lead people and create certainty from uncertainty.</p>\n<ul>\n<li>I successfully lead typical initiatives or engagements.</li>\n<li>I am recognised by my peers as someone who has in-depth knowledge and expertise in my field.</li>\n<li>I confidently step outside my comfort zone and adapt quickly to new team situations.</li>\n<li>I challenge others in order to grow their capabilities and to achieve a better outcome.</li>\n<li>I look after my team and put the teams' best interests first.</li>\n<li>I analyse complex scenarios across multiple knowledge areas.</li>\n<li>I regularly identify and present solutions to meet stakeholder objectives.</li>\n<li>I facilitate and effectively communicate with my peers and customers using relevant formats and medium.</li>\n<li>I set clear expectations for people and provide them feedback on how they are progressing against these expectations.</li>\n<li>My influence positively affects individuals within my squad and project stakeholders.</li>\n<li>I help to improve the capability of my team.</li>\n<li>I have difficult conversations when needed and do so with tact and care, escalating when appropriate.</li>\n<li>I learn my customer's business and discover opportunities to create value using Purple's capability.</li>\n<li>When required I contribute to business development by working with other teams within Purple.</li>\n</ul>\n<h1 id=\"managing-consultant-role-requirements\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#managing-consultant-role-requirements\"><span class=\"icon icon-link\"></span></a>Managing Consultant role requirements</h1>\n<p><img src=\"https://personas.purple.telstra.com/managingconsultant.svg\" alt=\"A cartoon of a managing consultant\" title=\"Managing Consultant\"></p>\n<p>I deliver extraordinary outcomes by contributing through others. I add significant strategic value to our business. I have a strong and positive influence to achieve successful results.</p>\n<ul>\n<li>I successfully lead high-risk initiatives or engagements.</li>\n<li>I am recognised as a trusted source for information in my field and my innovative ideas influence and guide others.</li>\n<li>I excel in conditions of complexity and uncertainty.</li>\n<li>I am a trusted partner with my squad and stakeholders.</li>\n<li>I proactively support and protect my team.</li>\n<li>I demonstrate creative problem solving, strategic planning and advanced communication skills.</li>\n<li>I engage with all project stakeholders as peers and challenge their decisions when necessary to provide them with the best outcome.</li>\n<li>I contribute to business development opportunities by working with other teams within Purple.</li>\n</ul>\n<h1 id=\"principal-consultant-role-requirements\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#principal-consultant-role-requirements\"><span class=\"icon icon-link\"></span></a>Principal Consultant role requirements</h1>\n<p><img src=\"https://personas.purple.telstra.com/principalconsultant.svg\" alt=\"A cartoon of a principal consultant\" title=\"Principal Consultant\"></p>\n<p>I am the custodian of delivery, with a deep understanding of Purple and customers businesses, advocating for our people and setting up projects for success.</p>\n<ul>\n<li>I ensure the successful delivery of our engagements.</li>\n<li>I support and advocate for our people.</li>\n<li>I engage with executive stakeholders as peers and challenge their decisions when necessary to provide them with the best outcome for the organisation.</li>\n<li>My influence positively affects individuals within Purple.</li>\n<li>I influence politicised environments to bring about positive outcomes for our customers.</li>\n<li>I am responsible for driving continuous improvement across our culture, our people and the way we work.</li>\n<li>I engage customers about their problems and goals and advise the best strategic approach and solution.</li>\n<li>I am an integral part of the sales process, providing expert advice and guidance, building trust, engaging customers, and helping to close the deal.</li>\n<li>I leverage the commercial model used by Purple to ensure successful and profitable engagements.</li>\n</ul>"}